{"title": "How to Reserve a Spot for an Event", "content": "If a user asks how to reserve an event:\n\n- Guide them to the CultPass app\n- Instruct them to browse the experience catalog and tap 'Reserve'\n- If it's a premium or limited event, check if reservation confirmation is required via email\n- Remind them to arrive at least 15 minutes early with their QR code visible\n\n**Suggested phrasing:**\n\"You can reserve an experience by opening the CultPass app, selecting your desired event, and tapping 'Reserve'. Be sure to arrive 15 minutes early with your QR code ready.\"", "tags": "reservation, events, booking, attendance"}
{"title": "What's Included in a CultPass Subscription", "content": "Each user is entitled to 4 cultural experiences per month, which may include:\n- Art exhibitions\n- Museum entries\n- Music concerts\n- Film screenings and more\n\nSome premium experiences may require an additional fee (visible in the app).\n\n**Suggested phrasing:**\n\"Your CultPass subscription includes 4 curated experiences each month. You can choose from museums, concerts, film events and more. Premium events may have an extra cost, which is shown during reservation.\"", "tags": "subscription, benefits, pricing, access"}
{"title": "How to Cancel or Pause a Subscription", "content": "Users can manage their subscription via the app > 'My Account' > 'Manage Plan'.\n\n- Cancel: Effective at the end of the billing cycle\n- Pause: Preserves user data, resumes automatically when reactivated\n- Do NOT offer refunds unless approved by support lead\n\n**Suggested phrasing:**\n\"You can cancel or pause your subscription at any time via the 'My Account' section in the CultPass app. Cancelation takes effect at the end of your billing cycle.\"", "tags": "cancelation, pause, subscription, billing"}
{"title": "How to Handle Login Issues?", "content": "Most login issues are resolved with password reset:\n\n- Ask the user to tap 'Forgot Password' on the login screen\n- Ensure they are using the correct registered email\n- If they did not receive the reset email, check spam folder or retry after 10 minutes\n- For persistent login issues, escalate to human support\n\n**Suggested phrasing:**\n\"Try tapping 'Forgot Password' on the login screen. Make sure you're using the email associated with your account. If the email doesn't arrive, check spam or try again in a few minutes.\"", "tags": "login, password, access, escalation"}
{"title": "How to Update Account Information", "content": "Users can update their account details including name, email, and notification preferences:\n\n- Open the CultPass app and go to 'My Account' > 'Profile Settings'\n- Tap on the field you wish to update\n- For email changes, verification is required via the new email address\n- Changes are saved automatically\n- Profile picture updates may take up to 24 hours to reflect\n\n**Suggested phrasing:**\n\"You can update your account information in the 'Profile Settings' section under 'My Account'. Email changes require verification through your new email address.\"", "tags": "account, profile, settings, email, update"}
{"title": "How to Change Password", "content": "Users can change their password at any time through the app:\n\n- Navigate to 'My Account' > 'Security' > 'Change Password'\n- Enter current password for verification\n- New password must be at least 8 characters with one uppercase letter and one number\n- After successful change, user will be logged out and need to log in again\n- All other active sessions will be terminated for security\n\n**Suggested phrasing:**\n\"You can change your password in the Security section under My Account. You'll need your current password, and the new one must be at least 8 characters with one uppercase letter and one number.\"", "tags": "password, security, account, authentication"}
{"title": "Understanding Billing Cycles and Charges", "content": "CultPass subscriptions are billed monthly:\n\n- Billing occurs on the same date each month as the original subscription start date\n- Basic tier: $19.99/month for 4 experiences\n- Premium tier: $34.99/month for 8 experiences + priority booking\n- Failed payments result in a 48-hour grace period before account suspension\n- Users can view billing history in 'My Account' > 'Billing'\n\n**Suggested phrasing:**\n\"Your subscription renews monthly on the same date you originally subscribed. You can view your billing history and payment method in the Billing section of My Account.\"", "tags": "billing, payment, subscription, pricing, charges"}
{"title": "Refund and Cancellation Policy", "content": "CultPass refund policy details:\n\n- Monthly subscriptions: No refunds for partial months, cancellation effective at end of billing cycle\n- Unused experiences do not roll over to the next month\n- Premium event add-on fees may be refunded if cancelled 48+ hours before the event\n- Refunds are processed within 5-7 business days to the original payment method\n- Account must be in good standing (no chargebacks or violations)\n\n**For refund requests:**\n- Verify the user's billing history and last payment date\n- Check if the refund qualifies under policy\n- For exceptions, escalate to support lead with justification\n\n**Suggested phrasing:**\n\"Refunds are generally not available for monthly subscription fees, but we can process cancellations effective at the end of your current billing cycle. Premium event fees may be refunded if cancelled 48+ hours in advance.\"", "tags": "refund, cancellation, billing, policy, payment"}
{"title": "App Not Loading or Crashing", "content": "Common solutions for app performance issues:\n\n- First, ensure the user has the latest version of CultPass (check App Store/Play Store)\n- Clear app cache: Settings > Apps > CultPass > Clear Cache (Android) or reinstall app (iOS)\n- Check device storage - app requires at least 100MB free space\n- Verify internet connection (app requires stable connection for content loading)\n- Try force-closing and reopening the app\n- If issue persists after these steps, escalate with device model and OS version\n\n**Suggested phrasing:**\n\"Let's troubleshoot this together. First, please make sure you have the latest version of the app installed. Then try clearing the app cache or reinstalling if you're on iOS.\"", "tags": "technical, app, crash, loading, troubleshooting"}
{"title": "QR Code Not Scanning at Events", "content": "Resolving QR code scanning issues:\n\n- Ensure screen brightness is at maximum when displaying QR code\n- Check that the reservation is confirmed (status should show 'Reserved' not 'Pending')\n- Try opening the QR code from 'My Reservations' rather than notifications\n- If QR code appears corrupted, pull down to refresh in the reservations screen\n- Venue staff can manually verify using the reservation ID shown below the QR code\n- For persistent issues, screenshot the QR code and escalate for regeneration\n\n**Suggested phrasing:**\n\"Please make sure your screen brightness is turned up and that your reservation status shows 'Reserved'. You can also show the venue staff your reservation ID number below the QR code for manual verification.\"", "tags": "qr code, technical, events, reservation, attendance"}
{"title": "How to Cancel a Reservation", "content": "Users can cancel event reservations through the app:\n\n- Go to 'My Reservations' and select the event to cancel\n- Tap 'Cancel Reservation' button\n- Cancellations made 24+ hours before event: experience credit returns to monthly quota\n- Cancellations within 24 hours: experience credit is forfeited\n- Premium event add-on fees: refundable if cancelled 48+ hours before event\n- Cancellation confirmation is sent via email\n\n**Suggested phrasing:**\n\"You can cancel a reservation in the 'My Reservations' section. If you cancel at least 24 hours before the event, the experience credit will be returned to your monthly quota.\"", "tags": "cancellation, reservation, booking, refund, quota"}
{"title": "No Available Experiences in My Area", "content": "When users report limited experiences in their location:\n\n- Verify their location settings are enabled for the app\n- CultPass currently operates in major Brazilian cities: Rio, São Paulo, Salvador, Recife, Brasília\n- New experiences are added weekly, typically on Mondays\n- Users can enable notifications for new experiences in their preferred categories\n- Premium tier users get early access to new experiences (48 hours before basic tier)\n- Suggest nearby cities if their location is not yet fully supported\n\n**Suggested phrasing:**\n\"CultPass adds new experiences every week. Make sure location services are enabled, and you can turn on notifications for new experiences in your favorite categories. Premium members get early access 48 hours before general availability.\"", "tags": "experiences, location, availability, booking, premium"}
{"title": "Upgrading from Basic to Premium", "content": "How to upgrade subscription tier:\n\n- Navigate to 'My Account' > 'Manage Plan' > 'Upgrade to Premium'\n- Premium benefits include:\n  * 8 experiences per month (vs 4 on Basic)\n  * Priority booking for high-demand events\n  * Early access to new experiences (48 hours early)\n  * Exclusive premium-only experiences\n  * Dedicated customer support line\n- Upgrade is effective immediately with pro-rated billing\n- First charge will be adjusted for remaining days in current cycle\n- Monthly quota increases immediately upon upgrade\n\n**Suggested phrasing:**\n\"You can upgrade to Premium anytime in the 'Manage Plan' section. Your upgrade takes effect immediately, and you'll be charged a pro-rated amount for the rest of this billing cycle.\"", "tags": "upgrade, premium, subscription, billing, benefits"}
{"title": "Premium Event Additional Fees", "content": "Understanding premium event pricing:\n\n- Premium events are marked with a gold star icon in the app\n- These events require an additional fee on top of the subscription (typically $10-$50)\n- Premium events do NOT count against your monthly experience quota\n- Examples: exclusive concerts, VIP museum tours, special exhibitions, chef's table experiences\n- Additional fees are charged separately at the time of reservation\n- Premium event fees are refundable if cancelled 48+ hours in advance\n- These events have limited capacity and often sell out quickly\n\n**Suggested phrasing:**\n\"Premium events require an additional fee but don't use up your monthly experience quota. They offer exclusive access to special cultural experiences with limited availability.\"", "tags": "premium, pricing, events, fees, billing"}
{"title": "Account Blocked or Suspended", "content": "Handling blocked account inquiries:\n\n- Accounts may be blocked for: payment failure, terms of service violation, fraudulent activity, or chargebacks\n- First step: Verify the reason in the account admin panel\n- For payment failures:\n  * User needs to update payment method and clear outstanding balance\n  * Account reinstates automatically once payment processes\n- For ToS violations:\n  * Review the specific violation with the user\n  * Minor violations: warn and unblock\n  * Serious violations (reselling tickets, fraudulent reservations): escalate to support lead\n- For fraudulent activity or chargebacks: must escalate to finance team, cannot unblock\n\n**Suggested phrasing:**\n\"I see your account is currently suspended. Let me look into the reason for you. In most cases, this is due to a payment issue that we can resolve together.\"", "tags": "blocked, suspended, account, violation, payment, escalation"}
